app/controllers/events_controller.rb

  def create


    # The 4 steps of form processing
    # 1) Instantiate a new object using form parameters
    # 2) Save the object
    # 3) if save succeds, redirec to the index action
    # 4) if save fails, redisplay the form so user can fix problems
    @event = Event.new(subject_params)


      if @event.save
---
INSERT INTO "events" ("category", "created_at", "description", "email", "title", "updated_at", "when", "where") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"